# enum of star-sign names and attribute names

def getSignName(num):
    return {
        1 : u'摩羯座',
        2 : u'水瓶座',
        3 : u'雙魚座',
        4 : u'牡羊座',
        5 : u'金牛座',
        6 : u'雙子座',
        7 : u'巨蟹座',
        8 : u'獅子座',
        9 : u'處女座',
        10: u'天秤座',
        11: u'天蠍座',
        12: u'射手座'
    }[num]

def getAttrName(num):
    return {
        1 : u'耐性',
        2 : u'脾氣暴躁',
        3 : u'幼稚',
        4 : u'頑固',
        5 : u'心思細膩',
        6 : u'保守',
        7 : u'冷靜',
        8 : u'樂觀',
        9 : u'活潑',
        10: u'公正',
        11: u'優柔寡斷',
        12: u'強勢',
        13: u'浪漫',
        14: u'過度理想化',
        15: u'斤斤計較',
        16: u'心機重',
        17: u'完美主義',
        18: u'愛計仇',
        19: u'與眾不同',
        20: u'愛面子',
        21: u'有魅力',
        22: u'正義感',
        23: u'重視友情',
        24: u'專情',
        25: u'愛哭',
        26: u'顧家',
        27: u'體貼',
        28: u'情緒化',
        29: u'口才',
        30: u'創意',
        31: u'潔癖'
    }[num]
